app/views/projects/show.html.erb

<h2>Notas</h2>
<% @project.notes.each do |note| %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."project_id" = $1  [["project_id", 1]]