app/controllers/notes_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "notes" ("texto", "project_id", "created_at", "updated_at", "arquived", "file") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		#@project = Project.find(params[:project_id])
		#@comment = @project.notes.create(note_params)
		#@comment.arquived = false
		#@comment.save

		#if @comment.save
	    #	redirect_to project_path(@project)
	  	#else
	  	#	@unarquived_notes_count = @project.notes.where(arquived: false).count;
	    #	render template: "projects/show"
	  	#end


		@project = Project.find(params[:project_id])
		@comment = @project.notes.build
		#@comment.texto = "testing"
		@comment.arquived = false
		file = File.open("./public/uploads/note/file/28/Screen_Shot_2019-08-04_at_9.24.45_PM.png")
		@comment.file = file
		@comment.save