app/controllers/notes_controller.rb

	def create
		@project = Project.find(params[:project_id])
		@comment = @project.notes.create(note_params)
		@comment.arquived = false
		@comment.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "notes" ("texto", "project_id", "created_at", "updated_at", "file") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["texto", "teste"], ["project_id", 73], ["created_at", "2019-08-04 22:08:13.016610"], ["updated_at", "2019-08-04 22:08:13.016610"], ["file", "Screen_Shot_2019-08-03_at_11.51.52_PM.png"]]
INSERT INTO "notes" ("texto", "project_id", "created_at", "updated_at", "arquived", "file") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "notes" SET "updated_at" = $1, "arquived" = $2 WHERE "notes"."id" = $3  [["updated_at", "2019-06-29 22:14:39.063364"], ["arquived", false], ["id", 5]]

	def arquive
		@note = Note.find(params[:id])
		@note.arquived = true;
		@note.arquived_date = DateTime.now;
		@note.save
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "notes" SET "arquived" = $1, "arquived_date" = $2, "updated_at" = $3 WHERE "notes"."id" = $4  [["arquived", true], ["arquived_date", "2019-06-29"], ["updated_at", "2019-06-29 22:14:58.847434"], ["id", 5]]