app/controllers/projects_controller.rb

	def show
		@project = Project.find(params[:id])
		@unarquived_notes_count = @project.notes.where(arquived: false).count;
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "notes" WHERE "notes"."project_id" = $1 AND "notes"."arquived" = $2  [["project_id", 1], ["arquived", false]]

	def create
		@project = Project.new(project_params)
		@project.data_de_conclusao = nil;
		@project.estado = "Ativo";

		if @project.save
---
INSERT INTO "projects" ("nome", "cliente", "estado", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "Projeto Novo"], ["cliente", "Lucas"], ["estado", "Ativo"], ["created_at", "2019-06-30 14:42:49.021285"], ["updated_at", "2019-06-30 14:42:49.021285"]]

	def update
		@project = Project.find(params[:id])

		if @project.update(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "projects" SET "nome" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["nome", "Projeto 4 editado"], ["updated_at", "2019-06-30 14:47:35.554828"], ["id", 4]]

	def conclude
		@project = Project.find(params[:id])
		@project.data_de_conclusao = DateTime.now
		@project.estado = "Concluído";
		@project.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]
UPDATE "projects" SET "data_de_conclusao" = $1, "estado" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["data_de_conclusao", "2019-06-30"], ["estado", "Concluído"], ["updated_at", "2019-06-30 14:43:58.238282"], ["id", 69]]

  	def arquive
		@project = Project.find(params[:id])
		@project.arquived = true;
		@project.arquived_date = DateTime.now;
		@project.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]
UPDATE "projects" SET "arquived" = $1, "arquived_date" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["arquived", true], ["arquived_date", "2019-06-30"], ["updated_at", "2019-06-30 14:44:02.964175"], ["id", 69]]

	def bulk_arquive
		params[:project_ids].each do |id|
			@project = Project.find(id)
			@project.arquived = true;
			@project.arquived_date = DateTime.now;
			@project.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "projects" SET "arquived" = $1, "arquived_date" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["arquived", true], ["arquived_date", "2019-06-30"], ["updated_at", "2019-06-30 14:47:59.458004"], ["id", 5]]